zhaozhi0810/iic-update-mcu-program-20230506/gd32f103-iap -2023-04-25-for-dg_keys_iic/user/src/ymodem.c
/*
*********************************************************************************************************
*	oˉ êy ??: Cal_CRC16
*	1|?ü?μ?÷: ????ò?′?êy?Yμ?CRC
*	D?    2?: data  êy?Y
*             size  êy?Y3¤?è
*	·μ ?? ?μ: CRC?????á1?
*********************************************************************************************************
*/
uint16_t Cal_CRC16(const uint8_t* data, uint32_t size)
{
	uint32_t crc = 0;
	const uint8_t* dataEnd = data+size;

	while(data < dataEnd)
		crc = UpdateCRC16(crc, *data++);

	crc = UpdateCRC16(crc, 0);
	crc = UpdateCRC16(crc, 0);

	return crc&0xffffu;
}




/**
  * @brief  Receive a packet from sender
  * @param  data
  * @param  length
  * @param  timeout
  *     0: end of transmission
  *    -1: abort by sender
  *    >0: packet length
  * @retval 0: normally return
  *        -1: timeout or packet error
  *         1: abort by user
  */
static int32_t Receive_Packet (uint8_t *data, int32_t *length, uint32_t timeout)
{
	uint16_t i, packet_size;
	uint8_t c,checksum;
	*length = 0;
	uint16_t tempCRC,tempCRC1;
	if (Receive_Byte(&c, timeout) != 0)
	{
		printf("Receive_Byte timeout\r\n");
		return -1;
	}
//	printf("Receive_Packet c = %#x\r\n",c);
	switch (c)
	{
		case SOH:
			packet_size = PACKET_SIZE;
			break;
		case STX:
			packet_size = PACKET_1K_SIZE;
			break;
		case EOT:
			return 0;
		case CA:
			if ((Receive_Byte(&c, timeout) == 0) && (c == CA))
			{
				*length = -1;
				return 0;
			}
			else
			{
				return -1;
			}
		case ABORT1:
		case ABORT2:
			printf("Receive_Packet c = %#x\r\n",c);
			return 1;
		default:
			return -1;
	}
	*data = c;
	checksum = c;
	for (i = 1; i < (packet_size + PACKET_OVERHEAD); i ++)
	{
	//	printf("for %d\r\n",packet_size + PACKET_OVERHEAD);
		if (Receive_Byte(data + i, timeout) != 0)
		{
			printf("for Receive_Byte error i = %d\r\n",i);
			return -1;
		}
	}
	if (data[PACKET_SEQNO_INDEX] != ((data[PACKET_SEQNO_COMP_INDEX] ^ 0xff) & 0xff))
	{
		printf("error: data[PACKET_SEQNO_INDEX] = %#x\r\n",data[PACKET_SEQNO_INDEX]);
		return -1;
	}
	
	if(is_cpu_update_cmd)  //从cpu升级，iic的方式
	{
		tempCRC = Cal_CRC16(&data[PACKET_HEADER], packet_size);
		tempCRC1 = data[packet_size + PACKET_HEADER]<<8 | data[packet_size + PACKET_HEADER+1];
		if(tempCRC != tempCRC1)
		{
			printf("checksum error checksum = %#x,data[%d] = %#x,%#x\r\n",tempCRC,packet_size + PACKET_HEADER,data[packet_size + PACKET_HEADER],data[packet_size + PACKET_HEADER+1]);
			return -1;
		}
		//CIRC_RELEASE(g_i2c0_txbuf);
	}
	
	*length = packet_size;
	return 0;
}





/**
  * @brief  Receive a file using the ymodem protocol
  * @param  buf: Address of the first byte
  * @retval The size of the file
  */
int32_t Ymodem_Receive (uint8_t *buf)
{
	uint8_t packet_data[PACKET_1K_SIZE + PACKET_OVERHEAD], file_size[FILE_SIZE_LENGTH], *file_ptr, *buf_ptr;
	int32_t i, j, packet_length, session_done, file_done, packets_received, errors, session_begin, size = 0;
	uint8_t key;
	uint8_t *pdown_md5 = (void*)(UPDATE_FLAG_START_ADDR + DOWN_MD5_OFFET);
	uint8_t md5_same = 0;  //md5相同为0，否则为1
	uint32_t FlashDestination_const;	
	uint8_t time_out = 0;   //做一个计时，如果计数120次（大概两分钟？），就退出下载模式
	/* Initialize FlashDestination variable */
	if(is_cpu_update_cmd) //rk3399下载的位置不同，是down分区
	{
		FlashDestination = ApplicationDownAddress;
		
	}
	else{
		FlashDestination = ApplicationAddress;
	}
	FlashDestination_const = FlashDestination;
	//printf("FlashDestination = %#x\r\n",FlashDestination);
	
	for (session_done = 0, errors = 0, session_begin = 0; ;)
	{
		for (packets_received = 0, file_done = 0, buf_ptr = buf; ;)
		{
			switch (Receive_Packet(packet_data, &packet_length, NAK_TIMEOUT))
			{
				case 0:   //0: normally return
					errors = 0;
					switch (packet_length)
					{
					/* Abort by sender */
						case - 1:
							Send_Byte(ACK);
							return 0;
						/* End of transmission */
						case 0:
							Send_Byte(ACK);
							file_done = 1;
							break;
						/* Normal packet */
						default:
							if((packet_data[PACKET_SEQNO_INDEX]) < packets_received)  //丢掉重复的包，ymodem可能会发送多次
							{
							//	packets_received--;
								continue;
							}
							//packets_received = packet_data[PACKET_SEQNO_INDEX];
							printf("packets_received = %d\r\n",packets_received);
							if ((packet_data[PACKET_SEQNO_INDEX] & 0xff) != (packets_received & 0xff))
							{
								printf("packet_data[PACKET_SEQNO_INDEX] = %#x packets_received = %d\r\n",packet_data[PACKET_SEQNO_INDEX],packets_received);
								Send_Byte(NAK);
							}
//							else if((packet_data[PACKET_SEQNO_INDEX]) == 0 && 1 == (packets_received & 0xff))
//							{
//								continue;
//							}
							else
							{
								if (packets_received == 0)   //2023-04-12 增加
								{
									/* Filename packet */
									if (packet_data[PACKET_HEADER] != 0)
									{
										//j=0;
										/* Filename packet has valid data */
										for (i = 0, file_ptr = packet_data + PACKET_HEADER; (*file_ptr != 0) && (i < FILE_NAME_LENGTH);)
										{
											file_name[i++] = *file_ptr++;
										//	j++;
										}
										file_name[i++] = '\0';
										printf("file_name = %s,j=%d\r\n",file_name,j);
										for (i = 0, file_ptr ++; (*file_ptr != ' ') && (i < FILE_SIZE_LENGTH);)
										{
											file_size[i++] = *file_ptr++;
										//	j++;
										}
										
										file_size[i++] = '\0';
										printf("file_size =%s,j=%d\r\n",file_size,j);
										Str2Int(file_size, &size);
										printf("size = %d\r\n",size);
										
										file_ptr ++;
										
										
										for (i = 0, file_ptr ++; (i < FILE_MD5_LENGTH);i++) //(*file_ptr != '\0') &&&& (*(pdown_md5+i) != '\0') 
										{
											md5sum_down[i] = *(file_ptr+i);
											//printf("*(pdown_md5+i) = %#x,*(file_ptr+i)=%#x,i=%d\r\n",*(pdown_md5+i),*(file_ptr+i),i);
											if(*(pdown_md5+i) != *(file_ptr+i))
											{
												md5_same = 1;  //md5不同，可以升级
											//	break;
											}
										//	j++;
										}
										md5sum_down[i] = '\0';
										printf("md5sum_down = %s\r\n",md5sum_down);
										//printf("j=%d\r\n",j);
										if(!md5_same) //md5一致，不升级
										{										
											/* End session */
											Send_Byte(CA);
											Send_Byte(CA);
										//	printf("md5 is the same, md5 = %s i = %d\r\n",file_ptr,i);											
										//	printf("md5sum_down = %s\r\n",md5sum_down);
										//	printf("pdown_md5 addr = %p\r\n",pdown_md5);
										//	printf("pdown_md5 = %s\r\n",pdown_md5);
											return -4;
										}
										//md5sum_down[i] = '\0';
										/* Test the size of the image to be sent */
										/* Image size is greater than Flash size */
										if (size > (FLASH_IMAGE_SIZE - 1))  //FLASH_SIZE
										{
											printf("size(%d) > (FLASH_IMAGE_SIZE - 1)(%d)\r\n",size , (FLASH_IMAGE_SIZE - 1));
											/* End session */
											Send_Byte(CA);
											Send_Byte(CA);
											return -1;
										}

										/* Erase the needed pages where the user application will be loaded */
										/* Define the number of page to be erased */
										NbrOfPage = FLASH_PagesMask(size);
										printf("NbrOfPage = %d\r\n",NbrOfPage);
										/* Erase the FLASH pages */
										for (EraseCounter = 0; (EraseCounter < NbrOfPage) && (FLASHStatus == FMC_READY); EraseCounter++)
										{
										//	printf("fmc_page_erase\r\n");
											FLASHStatus = fmc_page_erase(FlashDestination + (PageSize * EraseCounter));
										}
										Send_Byte(ACK);
										Send_Byte(CRC16);
									}
									/* Filename packet is empty, end session */
									else
									{
										Send_Byte(ACK);
										file_done = 1;
										session_done = 1;
										break;
									}
								}
								/* Data packet */
								else
								{
									memcpy(buf_ptr, packet_data + PACKET_HEADER, packet_length);
									
									if(packets_received == 1)  //可能下载的不是bin文件
									{
										if (((*(__IO uint32_t*)buf_ptr) & 0xfFFE0000 ) != 0x20000000)
										{
											Send_Byte(CA);
											Send_Byte(CA);
											printf("down file error 1,abort\r\n");
											/* End session */
											
